# Дан список [ 5, 3, 8, 13, 5, 6, 8, 15, 13, 5, 5, 8, ]

# Напишите функцию принимающую в себя этот список. Она должна возвращать следующий словарь:

# {3: 6, 5: 10, 6: 12, 8: 16, 13: 26, 15: 30, 'source': [3, 5, 6, 8, 13, 15], 'total': 50}

# def aaa() :   
#    lst = [ 5, 3, 8, 13, 5, 6, 8, 15, 13, 5, 5, 8, ]
#    lst1 = set(lst)
#    c = []
#    summ = 0
#    for item in lst1 :
#     summ += item
#    for i in lst1 :
#     a = {lst :lst*2 for lst in lst1}
#     c.append(i)
#     a.update(source = c , total = summ)
#    print(a)
# aaa() 

                                                   # Задание 2
                                                   
# Дается 2 строки "Aidana" и "Adilet" . Вам нужно в результате получить смешанную строку из двух имен, буква за буквой.
# Результат: "AAiddialneat"
# В решении обязательно должнен испрользоваться цикл for
   
# a = 'Aidana'
# b = 'Adilet'
# c = ''

# for i in range(len(a)) :
#    c += a[i] + b[i]
# print(c)   

